app/controllers/accounts_controller.rb

SELECT  "accounts".* FROM "accounts"  WHERE "accounts"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@account = Account.find(params[:id])

INSERT INTO "accounts" ("acc_class", "acc_type", "created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["acc_class", ""], ["acc_type", "Asset"], ["created_at", "2014-05-28 15:18:46.162707"], ["description", ""], ["name", ""], ["updated_at", "2014-05-28 15:18:46.162707"]]
---
	def create #Saves and redirects
		@account = Account.new(allowed_params)

		if @account.save

SELECT  "accounts".* FROM "accounts"  WHERE "accounts"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		@account = Account.find(params[:id])

SELECT  "accounts".* FROM "accounts"  WHERE "accounts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "accounts" SET "description" = ?, "updated_at" = ? WHERE "accounts"."id" = 1  [["description", "The money we expect to receive."], ["updated_at", "2014-05-26 14:58:53.444459"]]
---
	def update
		@account = Account.find(params[:id])
		if @account.update_attributes(allowed_params)

SELECT  "accounts".* FROM "accounts"  WHERE "accounts"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "accounts" WHERE "accounts"."id" = ?  [["id", 4]]
---
	def destroy
		@account = Account.find(params[:id])
		@account.destroy

SELECT "accounts".* FROM "accounts"
---
	def accounts #Yes, magic has been done here!
		@account = Account.new
		@accounts = Account.all